### LOAD IMPORTS

In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
from urllib.parse import quote_plus
from sqlalchemy.types import *
## importing text function to use on query with a "%" in it
from sqlalchemy import text
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
username = "root"
password = quote_plus("Brian@Schreffler")
db_name = "movies"

In [3]:
connection_str = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection_str)

In [4]:
database_exists(connection_str)

False

In [5]:
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

### LOAD IN DATA

In [6]:
basics = pd.read_csv('Data/final_basics.csv.gz',low_memory = False)
ratings = pd.read_csv('Data/final_ratings.csv.gz', low_memory = False)
year_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz', low_memory = False)
year_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz', low_memory = False)

### Getting List of Unique Genres

In [7]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance","[Musical, Romance]"
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
3,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action,[Action]
4,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
2999,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller","[Horror, Thriller]"
3000,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,[Action]
3001,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,[Action]
3002,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,[Horror]
3003,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,[Drama]

In [8]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Musical
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Romance
...,...,...,...,...,...,...,...,...,...,...
2999,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller",Thriller
3000,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,Action
3001,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,Action
3002,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,Horror
3003,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,Drama

In [9]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Thriller',
 'War',
 'Western']

### Create a new title_genres table

In [10]:
## Save just tconst and genres split as new df
title_genres = exploded_genres [['tconst','genres_split']].copy ()
title_genres.head ()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0113026      Musical
1  tt0113026      Romance

### Create a genre mapper dictionary to replace string genres with integers

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'Reality-TV': 15,
 'Romance': 16,
 'Sci-Fi': 17,
 'Short': 18,
 'Sport': 19,
 'Thriller': 20,
 'War': 21,
 'Western': 22}

### Replace the string genres in title_genres with the new integer ids.

In [12]:
basics = exploded_genres

basics["genre_id"] = basics["genres_split"].map(genre_map)
basics = basics.drop(columns = ["genres"])

In [13]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres_split,genre_id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,Comedy,5
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,Fantasy,9
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,Romance,16
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,Musical,13
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,Romance,16

In [14]:
#making genres dataframe
genres = pd.DataFrame({"genre_name":genre_map.keys(),
                      "genre_id":genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [15]:
#making title_genres dataframe
title_genres = pd.DataFrame({"tconst": basics["tconst"],
                            "genre_id": basics["genre_id"]})
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        16
1  tt0113026        13
1  tt0113026        16

In [16]:
#cleaning basics dataframe
basics = basics.drop(columns = ["originalTitle", "isAdult", "titleType", "genres_split", "genre_id"])

In [17]:
basics = basics.drop(columns = ['endYear'])

In [18]:
basics.head()

      tconst     primaryTitle  startYear  runtimeMinutes
0  tt0035423   Kate & Leopold     2001.0             118
0  tt0035423   Kate & Leopold     2001.0             118
0  tt0035423   Kate & Leopold     2001.0             118
1  tt0113026  The Fantasticks     2000.0              86
1  tt0113026  The Fantasticks     2000.0              86

In [19]:
basics.duplicated().sum()

2976

In [20]:
basics = basics.drop_duplicates()

basics.duplicated().sum()

0

In [21]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear': Float(),
    'runtimeMinutes': Integer()}

In [22]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype = df_schema,if_exists='replace',index=False)

3004

In [23]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

### Convert the title_rating SQL.

In [24]:
ratings = pd.read_csv("Data/title_ratings.csv.gz")
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262
2  tt0000003            6.5      1807
3  tt0000004            5.6       178
4  tt0000005            6.2      2604

In [25]:
ratings.duplicated().sum()

0

In [26]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len + 1), 
    "averageRating": Float(),
    "numVotes": Integer()
    }

In [27]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype = df_schema, if_exists='replace',index=False)

1299877

In [28]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

### Converting title_genres into SQL

In [29]:
## Calculate max string lengths for object columns
key_len = title_genres["tconst"].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Integer(),
    }

In [30]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype = df_schema,if_exists='replace',index=False)

5980

### Converting genres into SQL

In [31]:
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [32]:
## Calculate max string lengths for object columns
key_len = genres["genre_name"].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": Text(key_len+1), 
    "genre_id": Integer(),
    }

In [33]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype = df_schema,if_exists='replace',index=False)

23

In [34]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

### Converting tmdb_data into SQL

In [35]:
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,2174.0,PG

In [37]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2555 entries, 0 to 2554
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2555 non-null   object
 1   adult                  2553 non-null   float64
 2   backdrop_path          1379 non-null   object
 3   belongs_to_collection  204 non-null    object
 4   budget                 2553 non-null   float64
 5   genres                 2553 non-null   object
 6   homepage               172 non-null    object
 7   id                     2553 non-null   float64
 8   original_language      2553 non-null   object
 9   original_title         2553 non-null   object
 10  overview               2501 non-null   object
 11  popularity             2553 non-null   float64
 12  poster_path            2295 non-null   object
 13  production_companies   2553 non-null   object
 14  production_countries   2553 non-null   object
 15  release_date           2536 non-null   object
 16  revenue                2553 non-null   float64
 17  runtime                2553 non-null   float64
 18  spoken_languages       2553 non-null   object
 19  status                 2553 non-null   object
 20  tagline                1093 non-null   object
 21  title                  2553 non-null   object
 22  video                  2553 non-null   float64
 23  vote_average           2553 non-null   float64
 24  vote_count             2553 non-null   float64
 25  certification          811 non-null    object
dtypes: float64(9), object(17)
memory usage: 519.1+ KB

In [38]:
tmdb_data = tmdb_data.drop(columns = ['adult','backdrop_path','belongs_to_collection',
                                'genres','homepage','id','original_language',
                                'original_title','overview','popularity','poster_path',
                                'production_companies','production_countries','release_date',
                                'runtime','spoken_languages','status','tagline',
                                'title','video','vote_average','vote_count'])

In [39]:
tmdb_data = tmdb_data.drop(labels=0, axis=0)
tmdb_data.head()

     imdb_id      budget     revenue certification
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG
5  tt0118852         0.0         0.0             R

In [40]:
## Calculate max string lengths for object columns
key_len = tmdb_data["imdb_id"].fillna('').map(len).max() + 1
certification_len = tmdb_data["certification"].fillna("").map(len).max() + 1
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len),
    "budget": Float(),
    "revenue": Float(),
    "certification": Text(certification_len)
    }

In [41]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype = df_schema,if_exists='replace',index=False)

2554

In [42]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [43]:
#Testing to make sure sql loading happened
q = """
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data